---
type: KeyBasedTreeEntriesLoadContent
namespace: Autodesk.Revit.DB
version: 2024
members: 7
tags: [revit-api, class]
---

# KeyBasedTreeEntriesLoadContent

`Autodesk.Revit.DB.KeyBasedTreeEntriesLoadContent` · Revit 2024 · 7 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | AddEntry | 2015 | `public bool AddEntry ( KeyBasedTreeEntry entry )` |
| Method | BuildEntries | 2015 | `public void BuildEntries ()` |
| Method | CanAddEntry | 2015 | `public bool CanAddEntry ( KeyBasedTreeEntry entry )` |
| Method | GetEntries | 2015 | `public KeyBasedTreeEntries GetEntries ()` |
| Method | GetLoadResults | 2015 | `public KeyBasedTreeEntriesLoadResults GetLoadResults ()` |
| Method | IsEntriesBuilt | 2015 | `public static bool IsEntriesBuilt ( KeyBasedTreeEntriesLoadContent content )` |
| Method | Reset | 2015 | `public void Reset ()` |